_refs/diagrams-new/activities/administratoriaus_posisteme/Pridėti_patiekalą_į_menių.puml
@startuml activity_Pridėti_patiekalą_į_menių
skinparam style strictuml
skinparam swimlane {
  BorderColor #555
}
skinparam activity {
  BackgroundColor #FFFDE7
  BorderColor #F9A825
  DiamondBackgroundColor #E3F2FD
  DiamondBorderColor #1565C0
}

|Admin|
start
:Pasirinkti pridėjimą;
|Administratoriaus posistemė|
:Pateikti pridėjimo formą;
|Admin|
:Užpildyti pridėjimo formą ir patvirtinti;
|Administratoriaus posistemė|
:Patikrinti ar įvesti teisingi duomenų tipai;
:Patiktinti ar patiekalas nesidubliuoja sistemoje;
if () then ([duomenys klaidingi])
  :Pateikti klaidos pranešimą ir klaidingą duomenų lauką pridėjimo formoje;
else ([else])
endif
:Pridėti patiekalą;
stop

@enduml
